messageme-chat/app/controllers/chatroom_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    @message=Message.new
    @messages=Message.all.custom_display