messageme-chat/app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "khoobi"], ["user_id", 1], ["created_at", "2020-10-26 19:49:34.854793"], ["updated_at", "2020-10-26 19:49:34.854793"]]
---
  def create
    message =current_user.massages.build(message_params)
    if message.save