messageme-chat/app/controllers/session_controller.rb

  def login
    user=User.find_by(username:params[:session][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "sara"], ["LIMIT", 1]]